app/controllers/home_controller.rb

UPDATE `users` SET `updated_at` = '2011-08-10 22:11:30', `last_login` = '2011-08-10 22:11:30' WHERE `id` = 1
---
  def login
    @title = 'Login'
    if request.post?
      @user = User.authenticate( params[:user][:email], params[:user][:password] )
      if !@user.nil?
        session[:user_id] = @user.id
        flash[:message] = "Successfully logged in as #{@user.name}"
        @user.last_login = Time.now.utc
        @user.save(false)