app/controllers/restaurants_controller.rb

SELECT * FROM `restaurants`
---
  def index
    @restaurants = Restaurant.all