app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `last_login`, `updated_at`, `hashed_password`, `email`) VALUES('test', 'OvtigEoqRA', '2011-08-10 23:24:12', NULL, '2011-08-10 23:24:12', '6d0356a1d6f8c72962dd26234051dc7937f64def', 'test@marchex.com')